ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_xint_regs.xml
<module id="XINT_REGS" HW_revision="" description="XINT Registers">
	<register id="XINT1CR" width="16" page="0" offset="0x0" instances="1" instaddr="2" internal="0" description="XINT1 configuration register">
		<bitfield id="ENABLE" description="XINT1 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="POLARITY" description="XINT1 Polarity" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="XINT2CR" width="16" page="0" offset="0x2" instances="1" instaddr="2" internal="0" description="XINT2 configuration register">
		<bitfield id="ENABLE" description="XINT2 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="POLARITY" description="XINT2 Polarity" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="XINT3CR" width="16" page="0" offset="0x4" instances="1" instaddr="2" internal="0" description="XINT3 configuration register">
		<bitfield id="ENABLE" description="XINT3 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="POLARITY" description="XINT3 Polarity" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="XINT4CR" width="16" page="0" offset="0x6" instances="1" instaddr="2" internal="0" description="XINT4 configuration register">
		<bitfield id="ENABLE" description="XINT4 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="POLARITY" description="XINT4 Polarity" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="XINT5CR" width="16" page="0" offset="0x8" instances="1" instaddr="2" internal="0" description="XINT5 configuration register">
		<bitfield id="ENABLE" description="XINT5 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="POLARITY" description="XINT5 Polarity" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="XINT1CTR" width="16" page="0" offset="0x10" instances="1" instaddr="2" internal="0" description="XINT1 counter register">
		<bitfield id="INTCTR" description="XINT1 Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="XINT2CTR" width="16" page="0" offset="0x12" instances="1" instaddr="2" internal="0" description="XINT2 counter register">
		<bitfield id="INTCTR" description="XINT2 Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="XINT3CTR" width="16" page="0" offset="0x14" instances="1" instaddr="2" internal="0" description="XINT3 counter register">
		<bitfield id="INTCTR" description="XINT3 Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
</module>
